[
    {
        "user_input": "hey",
        "bot_response": "Good day.  How may I assist you today?  I understand you are interested in learning about Indian government schemes. To best help you, please tell me which area you'd like information on: education scholarships, healthcare, housing, agriculture, small business loans, employment, social security, women & child welfare, senior citizen benefits, or disability assistance.\n"
    },
    {
        "user_input": "hey",
        "bot_response": "Hello.  I understand you're interested in learning about Indian government schemes. To best assist you, please tell me which area you'd like information on: education scholarships, healthcare, housing, agricultural subsidies, small business loans, employment schemes, social security, women and child welfare, senior citizen benefits, or disability assistance.  Providing me with a specific area will allow me to give you the most relevant and concise information.\n"
    },
    {
        "user_input": "Hi",
        "bot_response": "Greetings.  I understand you're interested in learning about Indian government welfare schemes.  To best assist you, please tell me which area you'd like to know more about: education scholarships, healthcare, housing, agricultural subsidies, small business loans, employment schemes, social security, women and child welfare, senior citizen benefits, or disability assistance.  Providing me with a specific area will allow me to offer the most relevant and concise information.\n"
    },
    {
        "user_input": "Hello",
        "bot_response": "Hello.  I understand you'd like information about Indian government schemes.  To best assist you, please tell me which area you are interested in: Education scholarships, Healthcare schemes, Housing assistance, Agricultural subsidies, Small business loans, Employment schemes, Social security programs, Women and child welfare, Senior citizen benefits, or Disability assistance?  Providing this information will allow me to provide you with the most relevant and concise details.\n"
    },
    {
        "user_input": "supp",
        "bot_response": "I understand you're looking for information on government support programs in India.  To best assist you, please clarify what type of support you require.  For example, are you interested in education, healthcare, housing, agriculture, employment, or another area?  Providing me with more specifics will allow me to provide the most relevant information.\n"
    },
    {
        "user_input": "hello",
        "bot_response": "Hello.\nI understand you are looking for information on Indian government schemes.\nTo best assist you, please tell me which area you are interested in.\nFor example, are you interested in education scholarships, healthcare, housing, or another area?\nKnowing your specific needs will allow me to provide the most relevant information."
    },
    {
        "user_input": "I am farmer can you tell me the scheme for me",
        "bot_response": "Several Indian government schemes can benefit farmers.\nI cannot determine your precise eligibility without specific details about your circumstances (e.g., landholding, income, location), but I can provide information on some relevant schemes.\nYou should verify your eligibility and the most up\n- to-date details on the official government websites.\n\n1.\nPradhan Mantri Kisan Samman Nidhi (PM-KISAN):\n\n Eligibility Criteria:  Small and marginal farmers with cultivable land.\nSpecific criteria regarding landholding size may vary by state.\nBenefits Offered:  A financial benefit of ₹6000 per year, paid in three installments.\nRequired Documents:\n Aadhaar card, land records, bank account details.\n\n2.\nSoil Health Card Scheme:\n\n Eligibility Criteria: All farmers with cultivable land.\nBenefits Offered:  Provides information on the nutrient status of the farmer's soil, enabling targeted fertilizer use and improving crop yields.\nThis leads to cost savings and better crop production.\nRequired Documents:\n  Land ownership documents, farmer's identity proof.\n\n3.\nPradhan Mantri Krishi Sinchayee Yojana (PMKSY):\n\n Eligibility Criteria: Farmers depending on the specific sub\n\n- scheme within PMKSY (e.g., micro-irrigation).\nThis scheme focuses on improving irrigation infrastructure.\nEligibility will depend on the project and location.\nBenefits Offered:  Subsidies for micro\n\n- irrigation systems (drip, sprinkler irrigation), water harvesting, and other water management techniques.\nRequired Documents:\n  Land ownership documents, farmer's identity proof, project proposal (as per the specific sub\n\n- scheme).\n\n4.\nNational Agricultural Insurance Scheme (NAIS):\n\n Eligibility Criteria:  Farmers cultivating insured crops.\nSpecific crops and coverage vary based on location and insurance provider.\nBenefits Offered:  Financial protection against crop loss due to natural calamities.\nCompensation is paid based on the insured value and the extent of damage.\nRequired Documents:\n  Land ownership documents, crop details, insurance application form.\nThis is not an exhaustive list, and other schemes might be relevant depending on your specific needs and location.\nIt is crucial to check with your local agricultural department or the relevant government websites for detailed information and application procedures for these and other applicable schemes.\nRemember that eligibility criteria can change."
    },
    {
        "user_input": "I am farmer can you tell me the scheme for me",
        "bot_response": "Several Indian government schemes benefit farmers.\nThe Pradhan Mantri Kisan Samman Nidhi (PM\n- KISAN) provides income support of ₹6,000 annually to small and marginal farmers.\nEligibility requires ownership of cultivable land.\nBenefits include direct cash transfer.\nRequired documents include Aadhaar card, land ownership records, and bank details.\nOther schemes like the Soil Health Card scheme and crop insurance schemes are also available, with eligibility and benefits varying.\nVisit the Department of Agriculture & Cooperation website for detailed information."
    }
]